'''Домашнее задание
1) Создайте дескриптор, который будет делать поля класса управляемые им
доступными только для чтения.
2) Реализуйте функционал, который будет запрещать установку полей класса
любыми значениями, кроме целых чисел. Т.е., если тому или иному полю
попытаться присвоить, например, строку, то должно быть возбужденно
исключение.
3) Реализуйте
свойство
класса,
которое
обладает
следующим
функционалом: при установки значения этого свойства в файл с заранее
определенным названием должно сохранятся время (когда устанавливали
значение свойства) и установленное значение.'''